Tekla Open API Reference for Tekla Structures 2025
AABB.Collide Method
 Checks if the current axis-aligned 3d bounding box collides with another given axis-aligned 3d bounding box. Both axis-aligned 3d bounding boxes need to be in the same coordinate system or in the same workplane, so that they are defined using the same axes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Collide(
	AABB Other
)
Public Function Collide (
	Other As AABB
) As Boolean
Parameters
Other
Type: Tekla.Structures.Geometry3d.AABB
Another axis-aligned 3d bounding box to be used in the collision check.
Return Value
Type: Boolean
True if the axis-aligned 3d bounding boxes collide.
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace